W8D1/RedditClone/app/controllers/application_controller.rb

  def current_user
    return nil unless session[:session_token]
    @current_user ||= User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "HjvH0SDEJcy4Ns1rXb-zNA"], ["LIMIT", 1]]