W8D1/RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Post 1"], ["url", ""], ["content", ""], ["sub_id", 2], ["user_id", 13], ["created_at", "2019-10-07 21:09:06.530260"], ["updated_at", "2019-10-07 21:09:06.530260"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.sub_id = params[:sub_id]
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 13], ["id", 3], ["LIMIT", 1]]
---
  def edit
    @post = current_user.posts.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 13], ["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "hey who put this here?"], ["updated_at", "2019-10-07 21:24:55.630540"], ["id", 3]]
---
  def update
    @post = current_user.posts.find(params[:id])
    if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 13], ["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
  def destroy
    @post = current_user.posts.find(params[:id])
    @post.destroy