W8D1/RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @sub = current_user.subs.find(params[:id])

UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "The greatest league in the world"], ["updated_at", "2019-10-07 20:35:22.903941"], ["id", 1]]
---
  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update(sub_params)