W8D1/RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "jCXaIc2lVgZczuQVSoYogA"], ["updated_at", "2019-10-07 18:28:58.229206"], ["id", 1]]
---
  def reset_session_token!
    self.update!(session_token: SecureRandom.urlsafe_base64(16))